app/Controllers/Person.php

SELECT *
FROM `person`
---
    public function getPerson()
    {
        if ($this->request->isAJAX()) {
            $data = [
                'dataPerson' => $this->personModel->findAll()
            ];