app/Models/BookModel.php

SELECT *
FROM `book`
---
    public function getBook($id = false)
    {
        if ($id == false) {
            return $this->findAll();